def area(a):
    """Принимает число a, возвращает квадрат этого числа.

    Параметры:
    a (int, float): число, которое нужно возвести в квадрат

    Возвращает:
    int, float: квадрат числа a

    Пример использования:
    >>> area(5)
    25
    """
    return a * a


def perimeter(a):
    """Принимает число a, возвращает это число, умноженное на 4.

    Параметры:
    a (int, float): число, которое нужно умножить на 4

    Возвращает:
    int, float: число a, умноженное на 4

    Пример использования:
    >>> perimeter(5)
    20
    """
    return 4 * a